-- To Create Database and Import sample data Use Sample command below.
-- sqlite3.exe
-- sqlite> .open aptmanager.db
-- sqlite> .read sample_db.sql
CREATE TABLE homeinfo (
  home string PRIMARY KEY
, name string NOT NULL
, ordernum int NOT NULL);

INSERT INTO homeinfo VALUES
('가동 101호','0',1),
('가동 102호','0',2),
('가동 201호','0',3),
('가동 202호','0',4),
('가동 301호','0',5),
('가동 302호','0',6),
('가동 401호','0',7),
('가동 402호','0',8),
('가동 501호','0',9),
('가동 502호','0',10),
('가동 103호','0',11),
('가동 105호','0',12),
('가동 203호','0',13),
('가동 205호','0',14),
('가동 303호','0',15),
('가동 305호','0',16),
('가동 403호','0',17),
('가동 405호','0',18),
('가동 503호','0',19),
('가동 505호','0',20),
('가동 106호','0',21),
('가동 107호','0',22),
('가동 206호','0',23),
('가동 207호','0',24),
('가동 306호','0',25),
('가동 307호','0',26),
('가동 406호','0',27),
('가동 407호','0',28),
('가동 506호','0',29),
('가동 507호','0',30),
('가동 108호','0',31),
('가동 109호','0',32),
('가동 208호','0',33),
('가동 209호','0',34),
('가동 308호','0',35),
('가동 309호','0',36),
('가동 408호','0',37),
('가동 409호','0',38),
('가동 508호','0',39),
('가동 509호','0',40),
('가동 110호','0',41),
('가동 111호','0',42),
('가동 210호','0',43),
('가동 211호','0',44),
('가동 310호','0',45),
('가동 311호','0',46),
('가동 410호','0',47),
('가동 411호','0',48),
('가동 510호','0',49),
('가동 511호','0',50),
('가동 112호','0',51),
('가동 212호','0',52),
('가동 312호','0',53),
('가동 412호','0',54),
('나동 101호','0',55),
('나동 102호','0',56),
('나동 201호','0',57),
('나동 202호','0',58),
('나동 301호','0',59),
('나동 302호','0',60),
('나동 401호','0',61),
('나동 402호','0',62),
('나동 103호','0',63),
('나동 105호','0',64),
('나동 203호','0',65),
('나동 205호','0',66),
('나동 303호','0',67),
('나동 305호','0',68),
('나동 403호','0',69),
('나동 405호','0',70);

CREATE TABLE admexp (
  yyyymm string NOT NULL
, home string
, name string NOT NULL
, premonth int NOT NULL
, nowmonth int NOT NULL
, useamount int NOT NULL
, usecost int NOT NULL
, admexpcost int NOT NULL
, totalcost int NOT NULL
, remark string
, ordernum int NOT NULL
, PRIMARY KEY (yyyymm, home));

CREATE TABLE comcode (
comgroup int NOT NULL
, comcode int NOT NULL
, comvalue string NOT NULL
, comremark string
, PRIMARY KEY (comgroup, comcode)
);

INSERT INTO comcode VALUES
(1, 1 ,'25000','관리비'  ),
(2, 1 ,'5000' ,'수도요금'),
(2, 2 ,'5000' ,'수도요금'),
(2, 3 ,'5000' ,'수도요금'),
(2, 4 ,'5000' ,'수도요금'),
(2, 5 ,'5000' ,'수도요금'),
(2, 6 ,'5000' ,'수도요금'),
(2, 7 ,'5000' ,'수도요금'),
(2, 8 ,'5000' ,'수도요금'),
(2, 9 ,'5000' ,'수도요금'),
(2, 10,'6000' ,'수도요금'),
(2, 11,'6500' ,'수도요금'),
(2, 12,'7000' ,'수도요금'),
(2, 13,'7500' ,'수도요금'),
(2, 14,'8000' ,'수도요금'),
(2, 15,'8500' ,'수도요금'),
(2, 16,'9000' ,'수도요금'),
(2, 17,'9500' ,'수도요금'),
(2, 18,'10000','수도요금'),
(2, 19,'10500','수도요금'),
(2, 20,'11000','수도요금'),
(2, 21,'12000','수도요금'),
(2, 22,'13000','수도요금'),
(2, 23,'14000','수도요금'),
(2, 24,'15000','수도요금'),
(2, 25,'16000','수도요금'),
(2, 26,'17000','수도요금'),
(2, 27,'18000','수도요금'),
(2, 28,'19000','수도요금'),
(2, 29,'20000','수도요금'),
(2, 30,'21000','수도요금'),
(2, 31,'22000','수도요금'),
(2, 32,'23000','수도요금'),
(2, 33,'24000','수도요금'),
(2, 34,'25000','수도요금'),
(2, 35,'26000','수도요금'),
(2, 36,'27000','수도요금'),
(2, 37,'28000','수도요금'),
(2, 38,'29000','수도요금'),
(2, 39,'30000','수도요금'),
(2, 40,'31000','수도요금'),
(2, 41,'32000','수도요금'),
(2, 42,'33000','수도요금'),
(2, 43,'34000','수도요금'),
(2, 44,'35000','수도요금'),
(2, 45,'36000','수도요금'),
(2, 46,'37000','수도요금'),
(2, 47,'38000','수도요금'),
(2, 48,'39000','수도요금'),
(2, 49,'40000','수도요금'),
(2, 50,'41000','수도요금'),
(2, 51,'42000','수도요금'),
(2, 52,'43000','수도요금'),
(2, 53,'44000','수도요금'),
(2, 54,'45000','수도요금'),
(2, 55,'46000','수도요금'),
(2, 56,'47000','수도요금'),
(2, 57,'48000','수도요금'),
(2, 58,'49000','수도요금'),
(2, 59,'50000','수도요금'),
(2, 60,'51000','수도요금'),
(2, 61,'52000','수도요금'),
(2, 62,'53000','수도요금'),
(2, 63,'54000','수도요금'),
(2, 64,'55000','수도요금'),
(2, 65,'56000','수도요금'),
(2, 66,'57000','수도요금'),
(2, 67,'58000','수도요금');